---
kind: type
id: T:Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures
source: html/4a5aa425-e362-bf95-a1a0-2b4e41236917.htm
---
# Autodesk.Revit.DB.BuiltInFailures.AutoJoinFailures

Failures about AutoJoin.

## Syntax (C#)
```csharp
public static class AutoJoinFailures
```